FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/ns_НастройкиАвито.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ns_НастройкиАвито</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_Availability</v8:Type>
						<v8:Type>cfg:EnumRef.ns_AdStatus</v8:Type>
						<v8:Type>cfg:CatalogRef.ns_ШаблоныЗаголовков</v8:Type>
						<v8:Type>cfg:EnumRef.ns_AdType</v8:Type>
						<v8:Type>cfg:EnumRef.ns_ConditionЗапчасти</v8:Type>
						<v8:Type>cfg:EnumRef.ns_ListingFee</v8:Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>cfg:EnumRef.ns_AllowEmail</v8:Type>
						<v8:Type>cfg:CatalogRef.ns_ЗоныПоказаОбъявления</v8:Type>
						<v8:Type>cfg:EnumRef.ns_ВидыВыгрузки</v8:Type>
						<v8:Type>cfg:EnumRef.ns_ConditionХоббиИОтдых</v8:Type>
						<v8:Type>cfg:EnumRef.ns_ConditionБытоваяЭлектроника</v8:Type>
						<v8:Type>cfg:CatalogRef.ns_ШаблоныОбъявлений</v8:Type>
						<v8:Type>cfg:EnumRef.ns_ConditionМотоциклыИМототехника</v8:Type>
						<v8:Type>cfg:EnumRef.ns_ConditionЛичныеВещиНовое</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:EnumRef.ns_ConditionДляБизнеса</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:EnumRef.ns_ConditionДляДомаИДачи</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_НастройкиАвито</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/CommonModules/ns_ОбщегоНазначенияПовтИсп/Ext/Module.bsl
Функция ПолучитьПутьКХранилищу() Экспорт
	Возврат ПолучитьНастройку(Перечисления.ns_НастройкиАвито.ПутьДляВыгрузки, Ложь);
КонецФункции 

Функция ИспользоватьЗапчастиИАксессуары() Экспорт
	Возврат ПолучитьНастройку(Перечисления.ns_НастройкиАвито.ИспользоватьЗапчастиИАксессуары);
КонецФункции

Функция ИспользоватьБытоваяЭлектроника() Экспорт
	Возврат ПолучитьНастройку(Перечисления.ns_НастройкиАвито.ИспользоватьБытоваяЭлектроника);
КонецФункции

Функция ИспользоватьДляДомаИДачи() Экспорт
	Возврат ПолучитьНастройку(Перечисления.ns_НастройкиАвито.ИспользоватьДляДомаИДачи);
КонецФункции

Функция ИспользоватьДляБизнеса() Экспорт
	Возврат ПолучитьНастройку(Перечисления.ns_НастройкиАвито.ИспользоватьДляБизнеса);
КонецФункции

Функция ИспользоватьХоббиИОтдых() Экспорт
	Возврат ПолучитьНастройку(Перечисления.ns_НастройкиАвито.ИспользоватьХоббиИОтдых);
КонецФункции

Функция ИспользоватьЛичныеВещи() Экспорт
	Возврат ПолучитьНастройку(Перечисления.ns_НастройкиАвито.ИспользоватьЛичныеВещи);
КонецФункции

Функция ИспользоватьМотоциклыИМототехника() Экспорт
	Возврат ПолучитьНастройку(Перечисления.ns_НастройкиАвито.ИспользоватьМотоциклыИМототехника);
КонецФункции

Функция ПолучитьДобавлятьВВыгрузку() Экспорт
	Возврат ПолучитьНастройку(Перечисления.ns_НастройкиАвито.ДобавлятьВВыгрузку);
КонецФункции

Функция ПолучитьНомерДоговора() Экспорт
	Возврат ПолучитьНастройку(Перечисления.ns_НастройкиАвито.НомерДоговора, Ложь);
КонецФункции

Функция ПолучитьAdType() Экспорт
	Возврат ПолучитьНастройку(Перечисления.ns_НастройкиАвито.AdType, Ложь);
КонецФункции

Функция ПолучитьВидЦены() Экспорт                                     
	Идентификатор = ПолучитьНастройку(Перечисления.ns_НастройкиАвито.ВидЦены, Ложь);
	Возврат ns_Переопределяемый.ПолучитьСсылкуВидыЦен(Идентификатор);
КонецФункции
 
Функция ПолучитьВыбиратьМинимальнуюЦену() Экспорт
	Возврат ПолучитьНастройку(Перечисления.ns_НастройкиАвито.ВыбиратьМинимальнуюЦену);
КонецФункции

Функция ПолучитьШаблонПоУмолчанию() Экспорт
	Возврат ПолучитьНастройку(Перечисления.ns_НастройкиАвито.ШаблонПоУмолчанию, Ложь);
КонецФункции

Функция ПолучитьЗонуПоказаПоУмолчанию() Экспорт
	Возврат ПолучитьНастройку(Перечисления.ns_НастройкиАвито.ЗонаПоказаОбъявления, Ложь);
КонецФункции

Функция ПолучитьШаблонЗаголовка() Экспорт
	Возврат ПолучитьНастройку(Перечисления.ns_НастройкиАвито.ШаблонЗаголовка, Ложь);
КонецФункции

Функция ПолучитьНеВыгружатьВРезерве() Экспорт
	Возврат ПолучитьНастройку(Перечисления.ns_НастройкиАвито.НеВыгружатьВРезерве);
КонецФункции

Функция ПолучитьИмяДомена() Экспорт
	Возврат ПолучитьНастройку(Перечисления.ns_НастройкиАвито.ИмяДомена, Ложь);
КонецФункции

Функция ПолучитьПутьДляВыгрузки() Экспорт
	ПутьДляВыгрузки = ПолучитьНастройку(Перечисления.ns_НастройкиАвито.ПутьДляВыгрузки, Ложь);
	Если НЕ ЗначениеЗаполнено(ПутьДляВыгрузки) Тогда
		ПутьДляВыгрузки = "C:\Avito";
	КонецЕсли; 
	Возврат ПутьДляВыгрузки;
КонецФункции

Функция ПолучитьВидВыгрузки() Экспорт
	Возврат ПолучитьНастройку(Перечисления.ns_НастройкиАвито.ВидВыгрузки, Ложь);
КонецФункции

Функция ПолучитьConditionЗапчасти() Экспорт
	Возврат ПолучитьНастройку(Перечисления.ns_НастройкиАвито.ConditionЗапчасти, Ложь);
КонецФункции

Функция ПолучитьConditionБытоваяЭлектроника() Экспорт
	Возврат ПолучитьНастройку(Перечисления.ns_НастройкиАвито.ConditionБытоваяЭлектроника, Ложь);
КонецФункции

Функция ПолучитьConditionДляДомаИДачи() Экспорт
	Возврат ПолучитьНастройку(Перечисления.ns_НастройкиАвито.ConditionДляДомаИДачи, Ложь);
КонецФункции

Функция ПолучитьConditionДляБизнеса() Экспорт
	Возврат ПолучитьНастройку(Перечисления.ns_НастройкиАвито.ConditionДляБизнеса, Ложь);
КонецФункции

Функция ПолучитьConditionХоббиИОтдых() Экспорт
	Возврат ПолучитьНастройку(Перечисления.ns_НастройкиАвито.ConditionХоббиИОтдых, Ложь);
КонецФункции

Функция ПолучитьConditionЛичныеВещи() Экспорт
	Возврат ПолучитьНастройку(Перечисления.ns_НастройкиАвито.ConditionЛичныеВещи, Ложь);
КонецФункции

Функция ПолучитьConditionМотоциклыИМототехника() Экспорт
	Возврат ПолучитьНастройку(Перечисления.ns_НастройкиАвито.ConditionМотоциклыИМототехника, Ложь);
КонецФункции

Функция ПолучитьУстанавливатьДоступностьПоОстаткам() Экспорт
	Возврат ПолучитьНастройку(Перечисления.ns_НастройкиАвито.УстанавливатьДоступностьПоОстаткам);
КонецФункции

Функция ПолучитьБратьЗаголовокИзПолногоНаименования() Экспорт
	Возврат ПолучитьНастройку(Перечисления.ns_НастройкиАвито.БратьЗаголовокИзПолногоНаименования);
КонецФункции

Функция ПолучитьПодставлятьХарактеристикуВЗаголовок() Экспорт
	Возврат ПолучитьНастройку(Перечисления.ns_НастройкиАвито.ПодставлятьХарактеристикуВЗаголовок);
КонецФункции

Функция ПолучитьНеПерезаполнятьОписание() Экспорт
	Возврат ПолучитьНастройку(Перечисления.ns_НастройкиАвито.НеПерезаполнятьОписание);
КонецФункции

Функция ПолучитьНеПерезаполнятьЗаголовок() Экспорт
	Возврат ПолучитьНастройку(Перечисления.ns_НастройкиАвито.НеПерезаполнятьЗаголовок);
КонецФункции

Функция ПолучитьВыгружатьБезОстатков() Экспорт
	Возврат ПолучитьНастройку(Перечисления.ns_НастройкиАвито.ВыгружатьБезОстатков);
КонецФункции

Функция ПолучитьСоздаватьОбъявлениеНаКаждуюХарактеристику() Экспорт
	Возврат ПолучитьНастройку(Перечисления.ns_НастройкиАвито.СоздаватьОбъявлениеНаКаждуюХарактеристику);
КонецФункции

Функция ПолучитьБратьФотоАвито() Экспорт
	Возврат ПолучитьНастройку(Перечисления.ns_НастройкиАвито.БратьФотоАвито);
КонецФункции

Функция ПолучитьFTPIPАдрес() Экспорт
	Возврат ПолучитьНастройку(Перечисления.ns_НастройкиАвито.FTPIPАдрес, Ложь);
КонецФункции

Функция ПолучитьFTPLogin() Экспорт
	Возврат ПолучитьНастройку(Перечисления.ns_НастройкиАвито.FTPLogin, Ложь);
КонецФункции

Функция ПолучитьFTPPassword() Экспорт
	Возврат ПолучитьНастройку(Перечисления.ns_НастройкиАвито.FTPPassword, Ложь);
КонецФункции

Функция ПолучитьFTPПассивныйРежим() Экспорт
	Возврат ПолучитьНастройку(Перечисления.ns_НастройкиАвито.FTPПассивныйРежим);
КонецФункции

Функция ПолучитьFTPПорт() Экспорт
	FTPПорт = ПолучитьНастройку(Перечисления.ns_НастройкиАвито.FTPПорт, Ложь);
	Если НЕ ЗначениеЗаполнено(FTPПорт) Тогда
		FTPПорт = 21;
	КонецЕсли; 
	Возврат FTPПорт;
КонецФункции

Функция ПолучитьДобавлятьIDКатегории() Экспорт
	Возврат ПолучитьНастройку(Перечисления.ns_НастройкиАвито.ДобавлятьIDКатегории);
КонецФункции

Функция ПолучитьОтображатьИерархиюПоВидамНоменклатуры() Экспорт
	Возврат ПолучитьНастройку(Перечисления.ns_НастройкиАвито.ОтображатьИерархиюПоВидамНоменклатуры);
КонецФункции

Функция ПолучитьВыгружатьКартинкиБезОптимизации() Экспорт
	Возврат ПолучитьНастройку(Перечисления.ns_НастройкиАвито.ВыгружатьКартинкиБезОптимизации);
КонецФункции

Функция ПолучитьНастройку(Настройка, ЭтоБулево = Истина) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ns_НастройкиАвито.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.ns_НастройкиАвито КАК ns_НастройкиАвито
	|ГДЕ
	|	ns_НастройкиАвито.Настройка = &Настройка";
	Запрос.УстановитьПараметр("Настройка", Настройка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Если ЭтоБулево Тогда
			Возврат Ложь;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли; 
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
		
	Возврат Выборка.Значение;
КонецФункции
